[
  {
    "tutorialId": "msyGybzCKRs",
    "title": "Kunal Kushwaha",
    "subtitle": "About the Video",
    "para": "In this video you will understand what Open Source is and how contributing can help you."
  },
  {
    "tutorialId": "uj4fy4kpaOA",
    "title": "Love Babbar",
    "subtitle": "About the Video",
    "para": "This video includes overview of Git and Github, complete practical use of all the git commands IN JUST 33 MINUTES"
  },
  {
    "tutorialId": "2j7fD92g-gE",
    "title": "Simplilearn",
    "subtitle": "About the Video",
    "para": "This Git installation video will take you through the step by step process involved in Git installation on Windows."
  },
  {
    "tutorialId": "apGV9Kg7ics",
    "title": "Kunal Kushwaha",
    "subtitle": "About the Video",
    "para": "This tutorial will help you with using Git & GitHub for your personal projects and contributing to Open Source, with no prerequisites, in an easy to understand language."
  },
  {
    "tutorialId": "yzeVMecydCE",
    "title": "FreeCodeCamp",
    "subtitle": "About the Video",
    "para": "Learn why and how to contribute to open source software. You will learn about how to find projects to contribute to, how to make issues and PRs, how to make money from open source, and more."
  },
  {
    "tutorialId": "VdF6RvLiCao",
    "title": "Code For Cause",
    "subtitle": "About the Video",
    "para": "Are you a Java Developer looking for some Open Source organisations to contribute to? Here's a list of some Open Source organisations for you, & also some that take part in Google Summer of Code (GSoC) ☀️"
  },
  {
    "tutorialId": "SYtPC9tHYyQ",
    "title": "Eddie Jaoude",
    "subtitle": "About the Video",
    "para": "Learn the jargons of GitHub like tag/release, commit, branch, fork, project board, label, milestone, actions and much more!"
  },
  {
    "tutorialId": "GbqSvJs-6W4",
    "title": "Web Dev Simplified",
    "subtitle": "About the Video",
    "para": "In this video you will be guided through the process of finding your first issue and creating your first pull request."
  },
  {
    "tutorialId": "loCLu8Iq1dQ",
    "title": "Ishan Sharma",
    "subtitle": "About the Video",
    "para": "In this video, Kunal talks about his journey of getting into open source development and how he got the opportunity to become a Major League hacking Fellow. He talks about the benefits of contributing to open source as a developer, what are best open source orgs that you can check out to start contributing."
  },
  {
    "tutorialId": "L1X5f2ZxN0E",
    "title": "Eddie Jaoude",
    "subtitle": "About the Video",
    "para": "In this video how to find the open-source project using advance search in GitHub"
  },
  {
    "tutorialId": "1-LLMmKjj5I",
    "title": "Hrakirat singh",
    "subtitle": "About the Video",
    "para": "in this video you will learn about how to get ahead of 99% of software engineers"
  },
  {
    "tutorialId": "W7AewHnxMig",
    "title": "Ben Kadel",
    "subtitle": "About the Video",
    "para": "In this video I want to really quickly show you an extremely powerful search and filter functionality that is built into github.com that allows you to find repositories that are of interest to you, that are relevant to your skill-sets or just repos that are easy for beginners or in specific programming languages!"
  },
  {
    "tutorialId": "ZIkkPzTuOXw",
    "title": "Kunal Kushwaha",
    "subtitle": "About the Video",
    "para": "In this video, I have explained how you can find good first issues in open source projects and get your contributor journey started."
  },
  {
    "tutorialId": "x4hsV_q_YQc",
    "title": "Kunal Kushwaha",
    "subtitle": "About the Video",
    "para": "Here are 25+ Paid Open Source Programs and Internships that you can apply to. I share some of the rare programs that provide great exposure, stipends upto $10,000 that not many students know about."
  },
  {
    "tutorialId": "MT6M_sqAuZo",
    "title": "Ben Awad",
    "subtitle": "About the Video",
    "para": "In this video you will know How to become an expert in open source, And Open source is kind of fun."
  },
  {
    "tutorialId": "Uszj_k0DGsg",
    "title": "FreeCodeCamp",
    "subtitle": "About the Video",
    "para": "Git has the power to make you a better software developer. But you'll have to go beyond the basic 'commit, push, pull' to use it effectively! In this course, we'll look at some of the more advanced concepts and tools to make you more productive and confident with Git."
  },
  {
    "tutorialId": "nn9fF2wz3h4",
    "title": "Aman Dhattarwal",
    "subtitle": "About the Video",
    "para": "Google Summer of Code | All about GSOC | Step by Step Explanation | How to prepare for GSOC?"
  },
  {
    "tutorialId": "B67X9xtOyuI",
    "title": "Apna College ",
    "subtitle": "About the Video",
    "para":"5 Github Hacks that you should know | for Coders"

  }

]
